output$confirmed_greece_text <- renderText(
  paste(
    em("Δείτε την εξέλιξη των κρουσμάτων COVID-19 στην Ελλάδα."),
    br(),br(),
    "Το γράφημα δείχνει την εξέλιξη των επιβεβαιωμένων
   	κρουσμάτων στην Ελλάδα. Εμφανίζεται ο αριθμός των νέων επιβεβαιωμένων
    κρουσμάτων ανά ημέρα, αλλά και ο συνολικός αριθμός τους.",
    br(),br(),
    "Μπορείτε να επιλέξετε να σχεδιαστεί ο άξονας Υ, όσον αφορά στο συνολικό
    αριθμό επιβεβαιωμένων κρουσμάτων, χρησιμοποιώντας
    λογαριθμική κλίμακα."
  )
)

output$deaths_greece_text <- renderText(
  paste(
    em("Δείτε την εξέλιξη των θανάτων λόγω του COVID-19 στην Ελλάδα."),
    br(),br(),
    "Το γράφημα δείχνει την εξέλιξη των θανάτων λόγω του
   	κρουσμάτων στην Ελλάδα. Εμφανίζεται ο αριθμός των θανάτων ανά ημέρα, αλλά
    και ο συνολικός αριθμός τους.",
    br(),br(),
    "Μπορείτε να επιλέξετε να σχεδιαστεί ο άξονας Υ, όσον αφορά στο συνολικό
    αριθμό θανάτων, χρησιμοποιώντας
    λογαριθμική κλίμακα."
  )
)

output$icu_greece_text <- renderText(
  paste(
    em("Δείτε τον αριθμό των ασθενών στις ΜΕΘ."),
    br(),br(),
    "Το γράφημα δείχνει τη μεταβολή του αριθμού των ασθενών λόγω COVID-19 που
    βρίσκονται στις Μονάδες Εντατικής Θεραπείας στο σύνολο των νοσοκομείων της
    Ελληνικής επικράτειας."
  )
)

output$tests_greece_text <- renderText(
  paste(
    em("Δείτε τον αριθμό των ελέγχων δειγμάτων που έχουν πραγματοποιηθεί."),
    br(),br(),
    "Το γράφημα δείχνει τον αριθμό των εργαστηριακών ελέγχων δειγμάτων COVID-19
    που πραγματοποιούνται καθημερινά στην Ελλάδα, τόσο για τα δείγματα RT-PCR,
    όσο και για τα γρήγορα τεστ αντισωμάτων Rapid Ag, όπως επίσης και το αθροιστικό
    (συνολικό) αριθμό τους. Ο αριθμός των νέων ελέγχων εμφανίζεται στον αριστερό
    άξονα Υ, ενώ ο αριθμός των συνολικών ελέγχων δειγμάτων εμφανίζεται στον
    δεξί άξονα Υ.",
    br(),br(),
    "Μπορείτε να εμφανίσετε ή να κρύψετε μεταβλητές κάνοντας κλικ στα
    αντίστοιχα ονόματα στη λεζάντα. Με διπλό κλικ μπορείτε να απομονώσετε μία
    μεταβλητή.",
    br(),br(),
    "Μπορείτε επίσης να επιλέξετε να σχεδιαστεί ο δεξιός άξονας Υ (συνολικοί
    έλεγχοι) χρησιμοποιώντας λογαριθμική κλίμακα"
  )
)

output$vaccinations_text <- renderText(
  paste(
    em("Οι εμβολιασμοί που πραγματοποιούνται καθημερινά στην Ελλάδα."),
    br(),br(),
    "Στο γράφημα εμφανίζεται ο αριθμός των εμβολιασμών που πραγματοποιούνται
    καθημερινά σε ολόκληρη τη χώρα, καθώς και ο συνολικός αριθμός των
    εμβολιασμών που έχουν πραγματοποιηθεί."
  )
)

output$oxford_indices_text <- renderText(
  paste(
    em("Παρακολουθήστε τη μεταβολή δεικτών για τα κυβερνητικά μέτρα."),
    br(),br(),
    tags$a(href = "https://www.bsg.ox.ac.uk/research/research-projects/coronavirus-government-response-tracker", "Το πανεπιστήμιο της Οξφόρδης"),
    "συλλέγει καθημερινά πληροφορίες σχετικά με τη αντίδραση των κυβερνήσεων σε
    κάθε χώρα για την αντιμετώπιση του κορωνοϊού. Σε μια προσπάθεια
    ποσοτικοποίησης των μέτρων που λαμβάνονται, υπολογίζονται τέσσερις δείκτες
    κυβερνητικής αντίδρασης:",
    tags$ul(
      tags$li(tags$b("Δείκτης αυστηρότητας (Stringency Index):"),
              "μετρά την αυστηρότητα μέτρων σε σχέση με πολιτικές όπως η
              απαγόρευση  κυκλοφορίας, οι οποίες περιορίζουν τη συμπεριφορά
              των πολιτών."),
      tags$li(tags$b("Δείκτης κυβερνητικής αντίδρασης (Government Response Index):"),
              "ένας συνολικός δείκτης για τα αντανακλαστικά της κυβέρνησης.
              Καταγράφει τη συνολική αυστηρότητα των μέτρων που έχει θέσει η
              κυβέρνηση."),
      tags$li(tags$b("Δείκτης οικονομικής υποστήριξης (Economic Support Index):"),
              "καταγράφει την εφαρμογή μέτρων υποστήριξης, όπως η ενίσχυση
              εισοδημάτων και η απαλλαγή/διευκόλυνση στην αποπληρωμή χρεών."),
      tags$li(tags$b("Δείκτης περιορισμού και υγείας (Containment and Health Index):"),
              "συνδυάζει πληροφορίες σχετικά με μέτρα όπως ο περιορισμός
              κυκλοφορίας και κλεισίματα καταστημάτων και δομών, μαζί με
              μέτρα που αφορούν στις πολιτικές δειγματοληψίας και ανίχνευσης
              επαφών, βραχυπρόθεσμων επενδύσεων στην υγεία, καθώς και επενδύσεων
              σε εμβόλια"),
    ),
    "Οι δείκτες λαμβάνουν τιμές μεταξύ του 0 και του 100. Πριν τη λήψη
    οποιουδήποτε μέτρου είχαν όλοι μηδενική τιμή, ενώ υψηλότερες τιμές
    σηματοδοτούν αυστηρότερα μέτρα. Για περισσότερες πληροφορίες σχετικά με τον
    υπολογισμό των παραπάνω δεικτών, μπορείτε να επισκευθείτε την ιστοσελίδα",
    tags$a(href = "https://github.com/OxCGRT/covid-policy-tracker/blob/master/documentation/index_methodology.md",
           "της μεθοδολογίας"),
    "του Πανεπιστημίου της Οξφόρδης.",
    br(),br(),
    "Με κόκκινο χρώμα σηματοδοτείται η λήψη μέτρων, ενώ με πράσινο η
    απελευθέρωσή τους. Αφήνοντας το ποντίκι σας πάνω από ένα σημείο, εμφανίζεται
    μια αναλυτική περιγραφή του μέτρου."
  )
)

output$gender_greece_text <- renderText(
  paste(
    em("Ποια είναι η κατανομή των δύο φύλων στους ασθενείς;"),
    br(),br(),
    "Το γράφημα οπτικοποιεί τα ποσοστά που αντιστοιχούν στα δύο φύλα για τα
    επιβεβαιωμένα κρούσματα COVID-19 στην Ελλάδα."
  )
)

output$age_greece_text <- renderText(
  paste(
    em("Ποια είναι η ηλικία των ασθενών;"),
    br(),br(),
    "Στο γράφημα μπορείτε να δείτε την ηλικιακή κατανομή για τα επιβεβαιωμένα
    κρούσματα, για τους ασθενείς που βρίσκονται σε κρίσιμη κατάσταση, αλλά και
    για τους θανάτους που οφείλονται στον COVID-19.",
    br(),br(),
    "Μπορείτε να επιλέξετε τη μεταβλητή που επιθυμείτε να οπτικοποιήσετε, όπως
    επίσης και να επιλέξετε μεταξύ του να βλέπετε τον αριθμό των ατόμων ή τα
    ποσοστά τους."
  )
)

