output$confirmed_greece_text <- renderText(
  paste(
    em("Δείτε την εξέλιξη των κρουσμάτων COVID-19 στην Ελλάδα."),
    br(),br(),
    "Το γράφημα δείχνει την εξέλιξη των επιβεβαιωμένων
   	κρουσμάτων στην Ελλάδα. Εμφανίζεται ο αριθμός των νέων επιβεβαιωμένων
    κρουσμάτων ανά ημέρα, αλλά και ο συνολικός αριθμός τους.",
    br(),br(),
    "Μπορείτε να επιλέξετε να σχεδιαστεί ο άξονας Υ, όσον αφορά στο συνολικό
    αριθμό επιβεβαιωμένων κρουσμάτων, χρησιμοποιώντας
    λογαριθμική κλίμακα."
  )
)

output$deaths_greece_text <- renderText(
  paste(
    em("Δείτε την εξέλιξη των θανάτων λόγω του COVID-19 στην Ελλάδα."),
    br(),br(),
    "Το γράφημα δείχνει την εξέλιξη των θανάτων λόγω του
   	κρουσμάτων στην Ελλάδα. Εμφανίζεται ο αριθμός των θανάτων ανά ημέρα, αλλά
    και ο συνολικός αριθμός τους.",
    br(),br(),
    "Μπορείτε να επιλέξετε να σχεδιαστεί ο άξονας Υ, όσον αφορά στο συνολικό
    αριθμό θανάτων, χρησιμοποιώντας
    λογαριθμική κλίμακα."
  )
)

output$icu_greece_text <- renderText(
  paste(
    em("Δείτε τον αριθμό των ασθενών στις ΜΕΘ."),
    br(),br(),
    "Το γράφημα δείχνει τη μεταβολή του αριθμού των ασθενών λόγω COVID-19 που
    βρίσκονται στις Μονάδες Εντατικής Θεραπείας στο σύνολο των νοσοκομείων της
    Ελληνικής επικράτειας."
  )
)

output$tests_greece_text <- renderText(
  paste(
    em("Δείτε τον αριθμό των ελέγχων δειγμάτων που έχουν πραγματοποιηθεί."),
    br(),br(),
    "Το γράφημα δείχνει τον αριθμό των εργαστηριακών ελέγχων δειγμάτων COVID-19
    που πραγματοποιούνται καθημερινά στην Ελλάδα, όπως επίσης και το αθροιστικό
    (συνολικό) αριθμό τους. Ο αριθμός των νέων ελέγχων εμφανίζεται στον αριστερό
    άξονα Υ, ενώ ο αριθμός των συνολικών ελέγχων δειγμάτων εμφανίζεται στον
    δεξί άξονα Υ.",
    br(),br(),
    "Μπορείτε να εμφανίσετε ή να κρύψετε μεταβλητές κάνοντας κλικ στα
    αντίστοιχα ονόματα στη λεζάντα. Με διπλό κλικ μπορείτε να απομονώσετε μία
    μεταβλητή.",
    br(),br(),
    "Μπορείτε επίσης να επιλέξετε να σχεδιαστεί ο δεξιός άξονας Υ (συνολικοί
    έλεγχοι) χρησιμοποιώντας λογαριθμική κλίμακα"
  )
)

output$gender_greece_text <- renderText(
  paste(
    em("Ποια είναι η κατανομή των δύο φύλων στους ασθενείς;"),
    br(),br(),
    "Το γράφημα οπτικοποιεί τα ποσοστά που αντιστοιχούν στα δύο φύλα για τα
    επιβεβαιωμένα κρούσματα COVID-19 στην Ελλάδα."
  )
)

output$age_greece_text <- renderText(
  paste(
    em("Ποια είναι η ηλικία των ασθενών;"),
    br(),br(),
    "Στο γράφημα μπορείτε να δείτε την ηλικιακή κατανομή για τα επιβεβαιωμένα
    κρούσματα, για τους ασθενείς που βρίσκονται σε κρίσιμη κατάσταση, αλλά και
    για τους θανάτους που οφείλονται στον COVID-19.",
    br(),br(),
    "Μπορείτε να επιλέξετε τη μεταβλητή που επιθυμείτε να οπτικοποιήσετε, όπως
    επίσης και να επιλέξετε μεταξύ του να βλέπετε τον αριθμό των ατόμων ή τα
    ποσοστά τους."
  )
)

