output$case_evolution_west_macedonia_text <- renderText(
  paste(
    em("Δείτε την εξέλιξη των κρουσμάτων COVID-19 στη Δυτική Μακεδονία."),
    br(),br(),
    "Το γράφημα δείχνει την εξέλιξη των ενεργών κρουσμάτων, των επιβεβαιωμένων
   	κρουσμάτων, των αναρρώσεων και των ασθενών που βρίσκονται σε Μονάδες
    Εντατικής Θεραπείας (ΜΕΘ) στην Περιφέρεια Δυτικής Μακεδονίας.",
    br(),br(),
    "Μπορείτε να εμφανίσετε ή να κρύψετε μεταβλητές κάνοντας κλικ στα
    αντίστοιχα ονόματα στη λεζάντα. Με διπλό κλικ μπορείτε να απομονώσετε μία
    μεταβλητή.",
    br(),br(),
    "Δοκιμάστε να κάνετε διπλό κλικ στη γραμμή ΜΕΘ της λεζάντας.",
    br(),br(),
    "Μπορείτε επίσης να επιλέξετε να σχεδιαστεί ο άξονας Υ χρησιμοποιώντας
    λογαριθμική κλίμακα."
  )
)

output$hospitalized_west_macedonia_text <- renderText(
  paste(
    em("Δείτε τη μεταβολή των νοσηλευόμενων στα Νοσοκομεία της Δυτικής
       Μακεδονίας."),
    br(),br(),
    "Το γράφημα δείχνει τη μεταβολή στους αριθμούς των νοσηλευόμενων που
    βρίσκονται στα νοσοκομεία της Περιφέρειας Δυτικής Μακεδονίας. Συγκεκριμένα
    εμφανίζονται:",
    tags$ul(
      tags$li("Ο συνολικός αριθμός των νοσηλευόμενων. Ο αριθμός αυτός
              συμπεριλαμβάνει τους ασθενείς που εισήχθηκαν στο νοσοκομείο ως
              ύποπτα κρούσματα του COVID-19 και στη συνέχεια είτε βρέθηκαν
              θετικοί σε αυτόν, είτε βρέθηκαν αρνητικοί και παραμένουν υπό
              νοσηλεία στα νοσοκομεία. Περιλαμβάνει επίσης των αριθμό των
              ασθενών που έχουν εισαχθεί ως ύποπτα κρούσματα του COVID-19 και
              είναι σε αναμονή των αποτελεσμάτων"),
      tags$li("Ο αριθμός των νοσηλευόμενων που έχουν βρεθεί θετικοί στον COVID-19"),
      tags$li("Ο αριθμός των νοσηλευόμενων που έχουν βρεθεί αρνητικοί στον COVID-19"),
      tags$li("Ο αριθμός των νοσηλευόμενων που έχουν εξεταστεί για τον COVID-19
              και βρίσκονται σε αναμονή αποτελεσμάτων"),
    ),
    br(),
    "Μπορείτε να εμφανίσετε ή να κρύψετε μεταβλητές κάνοντας κλικ στα
    αντίστοιχα ονόματα στη λεζάντα. Με διπλό κλικ μπορείτε να απομονώσετε μία
    μεταβλητή.",
    br(),br(),
    "Μπορείτε επίσης να επιλέξετε να σχεδιαστεί ο άξονας Υ χρησιμοποιώντας
    λογαριθμική κλίμακα."
  )
)

output$home_restriction_west_macedonia_text <- renderText(
  paste(
    em("Δείτε τον αριθμό των ασθενών που βρίσκονται σε κατ'οίκον περιορισμό."),
    br(),br(),
    "Το γράφημα δείχνει τον αριθμό των πολιτών που βρίσκονται σε κατ'οίκον
    περιορισμό και υπό την επίβλεψη των αντίστοιχων νοσοκομείων. Αυτοί
    περιλαμβάνουν επιβεβαιωμένα κρούσματα, ύποπτα κρούσματα υπό διερεύνηση αλλά
    και άτομα που έχουν έρθει σε επαφή με ασθενείς ή ύποπτα κρούσματα.",
    br(),br(),
    "Μπορείτε να εμφανίσετε ή να αποκρύψετε νοσοκομεία κάνοντας κλικ στα
    ονόματά τους στη λεζάντα. Με διπλό κλικ μπορείτε να απομονώσετε ένα
    νοσοκομείο."
  )
)

output$tests_west_macedonia_text <- renderText(
  paste(
    em("Δείτε τον αριθμό των ελέγχων δειγμάτων που έχουν πραγματοποιηθεί στην
       Περιφέρεια Δυτικής Μακεδονίας."),
    br(),br(),
    "Το γράφημα δείχνει τον αριθμό των εργαστηριακών ελέγχων δειγμάτων COVID-19
    που πραγματοποιούνται καθημερινά στην Περιφέρεια Δυτικής Μακεδονίας, όπως
    επίσης και το αθροιστικό
    (συνολικό) αριθμό τους. Ο αριθμός των νέων ελέγχων εμφανίζεται στον αριστερό
    άξονα Υ, ενώ ο αριθμός των συνολικών ελέγχων δειγμάτων εμφανίζεται στον
    δεξί άξονα Υ.",
    br(),br(),
    "Μπορείτε να εμφανίσετε ή να κρύψετε μεταβλητές κάνοντας κλικ στα
    αντίστοιχα ονόματα στη λεζάντα. Με διπλό κλικ μπορείτε να απομονώσετε μία
    μεταβλητή.",
    br(),br(),
    "Μπορείτε επίσης να επιλέξετε να σχεδιαστεί ο δεξιός άξονας Υ (συνολικοί
    έλεγχοι) χρησιμοποιώντας λογαριθμική κλίμακα"
  )
)

output$discharges_by_hospital_west_macedonia_text <- renderText(
  paste(
    em("Δείτε τον αριθμό των εξιτηρίων από τα νοσοκομεία της Δυτικής
       Μακεδονίας."),
    br(),br(),
    "Το γράφημα δείχνει τον αριθμό των ασθενών που λαμβάνουν εξιτήριο από τα
    νοσοκομεία της Δυτικής Μακεδονίας καθημερινά.",
    br(),br(),
    "Μπορείτε να εμφανίσετε ή να αποκρύψετε νοσοκομεία κάνοντας κλικ στα
    ονόματά τους στη λεζάντα. Με διπλό κλικ μπορείτε να απομονώσετε ένα
    νοσοκομείο."
  )
)

output$deaths_histogram_west_macedonia_text <- renderText(
  paste(
    em("Ποιά είναι η ηλικία των θανόντων"),
    br(),br(),
    "Το ιστόγραμμα αυτό παρουσιάζει την ηλικιακή κατανομή των θανόντων λόγω του
    COVID-19.",
    br(),br(),
    "Έχετε τη δυνατότητα να επιλέξετε αν θέλετε να εμφανίζεται η κατανομή
    ασχέτως φύλου, ή να επιλέξετε κάποιο από τα δύο φύλα."
  )
)

ex <- data_west_macedonia_deaths %>%
  filter(sex == "Άνδρες") %>%
  pull(age)
output$deaths_age_boxplot_west_macedonia_text <- renderText(
  paste(
    em("Θηκόγραμμα των ηλικιών των θανόντων ανά φύλο"),
    br(),br(),
    "Το θηκόγραμμα (boxplot) είναι ένα ακόμα γράφημα το οποίο αναπαριστά την κατανομή
    τιμών.",
    br(),br(),
    "Η γραμμή που χωρίζει το «κουτί» στη μέση, ονομάζεται διάμεσος και
    είναι η κεντρική τιμή (ή αλλιώς η τιμή που βρίσκεται στο 50% των τιμών),
    αν όλες οι τιμές τοποθετηθούν σε αύξουσα
    σειρά. Για παράδειγμα, για τις τιμές [1,2,4,9,18], η διάμεσος είναι το
    4. Αν αφήσετε το ποντίκι σας πάνω στο θηκόγραμμα που αντιστοιχεί στους
    άντρες, θα δείτε ότι η διάμεσος (median) είναι ίση με",
    median(ex),
    ".",
    br(),br(),
    "Επιπρόσθετα, τα όρια του «κουτιού» ορίζονται από τις τιμές Q1 (κάτω) και
    Q3 (πάνω), οι οποίες αντιστοιχούν στις τιμές που βρίσκονται στο 25% και 75%
    των τιμών. Το ενδιαφέρον στοιχείο είναι ότι, με αυτό τον τρόπο, μέσα στο
    «κουτί» περιλαμβάνονται το κεντρικό 50% των τιμών. Για παράδειγμα, μπορείτε
    να δείτε, αν αφήσετε το ποντίκι ας πάνω στο θηκόγραμμα που αντιστοιχεί στους
    άντρες, ότι η ηλικία των μισών αντρών που έχουν χάσει τη ζωή τους λόγω του
    COVID-19 είναι ανάμεσα στα",
    quantile(ex, 0.25, type = 5),
    "και",
    quantile(ex, 0.75, type = 5),
    "έτη.",
    br(),br(),
    "Σε περίπτωση που υπάρχουν τιμές που απέχουν πολύ από τις υπόλοιπες
    (είναι δηλαδή απομακρυσμένες), είτε
    προς τα πάνω, είτε προς τα κάτω, αυτές θα φαίνονται πάνω στο γράφημα ως
    μεμονωμένα σημεία. Σε οποιαδήποτε περίπτωση, οι γραμμές που εκτείνται πάνω
    και κάτω από το «κουτί», είναι αντίστοιχα η μεγαλύτερη και η μικρότερη τιμή
    που δεν ορίζεται ως απομακρυσμένη. Βεβαίως, ενδέχεται να μην υπάρχει καμία
    απομακρυσμένη τιμή, οπότε οι γραμμές εκτείνονται μέχρι την μέγιστη και
    ελάχιστη τιμή αντίστοιχα."
  )
)

output$deaths_age_west_macedonia_text <- renderText(
  paste(
    em("Ποιο φύλο είναι πιο επιρρεπές στο θάνατο από τον COVID-19;"),
    br(),br(),
    "Στο γράφημα μπορείτε να δείτε το συνολικό ποσοστό θανάτων ως αποτέλεσμα του
    COVID-19, στην Περιφέρεια Δυτικής Μακεδονίας, ανά φύλο.",
    br(),br(),
    "Αφήνοντας το ποντίκι πάνω σε ένα από τα δύο κομμάτια του γραφήματος πίτας,
    μπορείτε να δείτε τον ακριβή αριθμό των θανάτων καθώς και το ποσοστό στο
    οποίο αντιστοιχούν στο σύνολο."
  )
)

output$deaths_by_date_west_macedonia_text <- renderText(
  paste(
    em("Ο αριθμός των θανάτων ανά ημέρα"),
    br(),br(),
    paste0(
    "Στο γράφημα αυτό φαίνεται ο αριθμός των θανάτων ανά ημέρα. Η ημέρα με τους
    περισσότερους θανάτους ήταν η ",
    data_west_macedonia_deaths %>%
      group_by(date) %>%
      summarize(freq = n()) %>%
      arrange(-freq) %>%
      top_n(1) %>%
      pull(date) %>%
      as.Date("%Y-%m-%d") %>%
      format("%d/%m/%Y")
    ),
    "."
  )
)

output$deaths_by_municipality_west_macedonia_text <- renderText(
  paste(
    em("Σε ποιούς Δήμους εντοπίζονται οι περισσότεροι θανάτους λόγω του COVID-19;"),
    br(),br(),
    "Στο γράφημα μπορείτε να δείτε τον αριθμό των θανάτων που εντοπίζονται σε
    κάθε Δήμο της Περιφέρειας Δυτικής Μακεδονίας,  διαχωριζόμενους ανά φύλο.",
    br(),br(),
    "Μπορείτε να απομονώσετε ένα φύλο, κάνοντας κλικ ή διπλό κλικ στις
    αντίστοιχες γραμμές της λεζάντας."
  )
)