output$case_evolution_west_macedonia_text <- renderText(
  paste(
    em("Δείτε την εξέλιξη των κρουσμάτων COVID-19 στη Δυτική Μακεδονία."),
    br(),br(),
    "Το γράφημα δείχνει την εξέλιξη των ενεργών κρουσμάτων, των επιβεβαιωμένων
   	κρουσμάτων, των αναρρώσεων και των ασθενών που βρίσκονται σε Μονάδες
    Εντατικής Θεραπείας (ΜΕΘ) στην Περιφέρεια Δυτικής Μακεδονίας.",
    br(),br(),
    "Μπορείτε να εμφανίσετε ή να κρύψετε μεταβλητές κάνοντας κλικ στα
    αντίστοιχα ονόματα στη λεζάντα. Με διπλό κλικ μπορείτε να απομονώσετε μία
    μεταβλητή.",
    br(),br(),
    "Δοκιμάστε να κάνετε διπλό κλικ στη γραμμή ΜΕΘ της λεζάντας.",
    br(),br(),
    "Μπορείτε επίσης να επιλέξετε να σχεδιαστεί ο άξονας Υ χρησιμοποιώντας
    λογαριθμική κλίμακα."
  )
)

output$hospitalized_west_macedonia_text <- renderText(
  paste(
    em("Δείτε τη μεταβολή των νοσηλευόμενων στα Νοσοκομεία της Δυτικής
       Μακεδονίας."),
    br(),br(),
    "Το γράφημα δείχνει τη μεταβολή στους αριθμούς των νοσηλευόμενων που
    βρίσκονται στα νοσοκομεία της Περιφέρειας Δυτικής Μακεδονίας. Συγκεκριμένα
    εμφανίζονται:",
    tags$ul(
      tags$li("Ο συνολικός αριθμός των νοσηλευόμενων"),
      tags$li("Ο αριθμός των νοσηλευόμενων που έχουν βρεθεί θετικοί στον COVID-19"),
      tags$li("Ο αριθμός των νοσηλευόμενων που έχουν βρεθεί αρνητικοί στον COVID-19"),
      tags$li("Ο αριθμός των νοσηλευόμενων που έχουν εξεταστεί για τον COVID-19
              και βρίσκονται σε αναμονή αποτελεσμάτων"),
    ),
    br(),
    "Μπορείτε να εμφανίσετε ή να κρύψετε μεταβλητές κάνοντας κλικ στα
    αντίστοιχα ονόματα στη λεζάντα. Με διπλό κλικ μπορείτε να απομονώσετε μία
    μεταβλητή.",
    br(),br(),
    "Μπορείτε επίσης να επιλέξετε να σχεδιαστεί ο άξονας Υ χρησιμοποιώντας
    λογαριθμική κλίμακα."
  )
)

output$home_restriction_west_macedonia_text <- renderText(
  paste(
    em("Δείτε τον αριθμό των ασθενών που βρίσκονται σε κατ'οίκον περιορισμό."),
    br(),br(),
    "Το γράφημα δείχνει τον αριθμό των πολιτών που βρίσκονται σε κατ'οίκον
    περιορισμό και υπό την επίβλεψη των αντίστοιχων νοσοκομείων. Αυτοί
    περιλαμβάνουν επιβεβαιωμένα κρούσματα, ύποπτα κρούσματα υπό διερεύνηση αλλά
    και άτομα που έχουν έρθει σε επαφή με ασθενείς ή ύποπτα κρούσματα.",
    br(),br(),
    "Μπορείτε να εμφανίσετε ή να αποκρύψετε νοσοκομεία κάνοντας κλικ στα
    ονόματά τους στη λεζάντα. Με διπλό κλικ μπορείτε να απομονώσετε ένα
    νοσοκομείο."
  )
)

output$tests_west_macedonia_text <- renderText(
  paste(
    em("Δείτε τον αριθμό των ελέγχων δειγμάτων που έχουν πραγματοποιηθεί στην
       Περιφέρεια Δυτικής Μακεδονίας."),
    br(),br(),
    "Το γράφημα δείχνει τον αριθμό των εργαστηριακών ελέγχων δειγμάτων COVID-19
    που πραγματοποιούνται καθημερινά στην Περιφέρεια Δυτικής Μακεδονίας, όπως
    επίσης και το αθροιστικό
    (συνολικό) αριθμό τους. Ο αριθμός των νέων ελέγχων εμφανίζεται στον αριστερό
    άξονα Υ, ενώ ο αριθμός των συνολικών ελέγχων δειγμάτων εμφανίζεται στον
    δεξί άξονα Υ.",
    br(),br(),
    "Μπορείτε να εμφανίσετε ή να κρύψετε μεταβλητές κάνοντας κλικ στα
    αντίστοιχα ονόματα στη λεζάντα. Με διπλό κλικ μπορείτε να απομονώσετε μία
    μεταβλητή.",
    br(),br(),
    "Μπορείτε επίσης να επιλέξετε να σχεδιαστεί ο δεξιός άξονας Υ (συνολικοί
    έλεγχοι) χρησιμοποιώντας λογαριθμική κλίμακα"
  )
)

output$discharges_by_hospital_west_macedonia_text <- renderText(
  paste(
    em("Δείτε τον αριθμό των εξιτηρίων από τα νοσοκομεία της Δυτικής
       Μακεδονίας."),
    br(),br(),
    "Το γράφημα δείχνει τον αριθμό των ασθενών που λαμβάνουν εξιτήριο από τα
    νοσοκομεία της Δυτικής Μακεδονίας καθημερινά.",
    br(),br(),
    "Μπορείτε να εμφανίσετε ή να αποκρύψετε νοσοκομεία κάνοντας κλικ στα
    ονόματά τους στη λεζάντα. Με διπλό κλικ μπορείτε να απομονώσετε ένα
    νοσοκομείο."
  )
)

output$deaths_histogram_west_macedonia_text <- renderText(
  paste(
    em("Ποιά είναι η ηλικία των θανόντων"),
    br(),br(),
    "Το ιστόγραμμα αυτό παρουσιάζει την ηλικιακή κατανομή των θανόντων λόγω του
    COVID-19.",
    br(),br(),
    "Έχετε τη δυνατότητα να επιλέξετε αν θέλετε να εμφανίζεται η κατανομή
    ασχέτως φύλου, ή να επιλέξετε κάποιο από τα δύο φύλα."
  )
)

output$deaths_age_west_macedonia_text <- renderText(
  paste(
    em("Ποιο φύλο είναι πιο επιρρεπές στο θάνατο από τον COVID-19;"),
    br(),br(),
    "Στο γράφημα μπορείτε να δείτε το συνολικό ποσοστό θανάτων ως αποτέλεσμα του
    COVID-19, στην Περιφέρεια Δυτικής Μακεδονίας, ανά φύλο.",
    br(),br(),
    "Αφήνοντας το ποντίκι πάνω σε ένα από τα δύο κομμάτια του γραφήματος πίτας,
    μπορείτε να δείτε τον ακριβή αριθμό των θανάτων καθώς και το ποσοστό στο
    οποίο αντιστοιχούν στο σύνολο."
  )
)