output$twitter_general_text <- renderText(
  paste(
    h5("Σχετικά με τη συλλογή δεδομένων του Twitter"),
    br(),
    "Το εργαστήριο DATALAB έχοντας πολυετή εμπειρία στη συλλογή κι ανάλυση
    δεδομένων από τα κοινωνικά δίκτυα, προχώρησε στην συλλογή αναρτήσεων σχετικά
    με την πανδημία του κορωνοϊού από χρήστες του Twitter. Η συλλογή ξεκίνησε
    στις 25 Φεβρουαρίου 2020 και συνεχίζεται μέχρι και σήμερα. Η διαδικασία αυτή
    έγινε χρησιμοποιώντας το",
    tags$a(href = "https://developer.twitter.com/en/docs",
           "επίσημο API του Twitter"),
    "και συλλέγοντας όλες τις αναρτήσεις (tweets) που περιέχουν τα παρακάτω
    hashtags: #κορωνοιος, #COVID19greece, #covid19greece, #μενουμε_σπιτι,
    #μενουμεσπιτι, #μενουμε_ασφαλεις, #κορονα, #κορονοϊος, #καραντινα, #εοδυ, #eody,
    #απαγορευση_κυκλοφοριας, #απαγορευσηκυκλοφοριας. Τα παρακάτω γραφήματα
    αποτυπώνουν ενδεικτικά την χρήση του Twitter κατά τη διάρκεια της επιδημίας."
  )
)


output$twitter_hashtags_per_day_text <- renderText(
  paste(
    em("Δείτε τα πιο δημοφιλή hashtag ανά ημέρα"),
    br(),br(),
    "Το γράφημα παρουσιάζει τα hashtags που χρησιμοποιήθηκαν περισσότερο από
    τους χρήστες του Τwitter στην Ελλάδα, σε δημοσιεύσεις που αφορούσαν στον
    κορωνοϊό. Όσο μεγαλύτερο το μέγεθος των γραμμάτων, τόσο μεγαλύτερη και η
    συχνότητα εμφάνισης του συγκεκριμένου hashtag για την συγκεκριμένη μέρα.
    Ο χρήστης μπορεί έτσι να καταλάβει τις εναλλασσόμενες τάσεις που
    επικρατούσαν στα κοινωνικά δίκτυα."
  )
)

output$twitter_hashtags_text <- renderText(
  paste(
    em("Τα πιο δημοφιλή hashtag σε ολόκληρη αυτή την περίοδο"),
    br(),br(),
    "Όμοια με το προηγούμενο, το συγκεκριμένο γράφημα παρουσιάζει τα πιο
    δημοφιλή hashtags, αλλά για το σύνολο όλων των ημέρων για τις οποίες
    συλλέγονται τα δεδομένα κι όχι για κάθε μέρα ξεχωριστά."
  )
)

output$twitter_tweets_per_day_text <- renderText(
  paste(
    em("Αριθμός δημοσιεύσεων (tweets) που αφορούν στον κορωνοϊό σε σχέση με τον χρόνο"),
    br(),br(),
    "Το συγκεκριμένο γράφημα, δειχνει τον αριθμό των tweets ανά ημέρα. Ο χρήστης
    μπορεί άμεσα να συμπεράνει ότι κατά τη διάρκεια του lockdown η χρήση του
    Twitter ήταν σαφώς υψηλότερη από τις υπόλοιπες μέρες. Πιο συγκεκριμένα όσο
    τα μέτρα κατά του κορωνοϊού αύστηροποιούνταν, τόσο περισσότερες ήταν οι
    σχετικές δημοσιεύσεις. Η επερχόμενη χαλάρωση των μέτρων συνοδεύεται από
    χαμηλότερο αριθμό σχετικών δημοσιεύσεων."
  )
)

output$twitter_links_total_text <- renderText(
  paste(
    em("Οι δημοφιλέστεροι σύνδεσμοι"),
    br(),br(),
    "Οι χρήστες του Twitter έχουν την δυνατότητα να μοιράζονται συνδέσμους της
    αρεσκείας τους με άλλους χρήστες. Αυτή η λίστα παρουσιάζει τους συνδέσμους
    που διαμοιράστηκαν περισσότερο από την ημέρα που ξεκίνησε η συλλόγή των
    δεδομένων μέχρι σήμερα. Παρατηρώντας την λίστα, ο χρήστης μπορεί να
    ανακαλύψει τα θέματα που οι χρήστες του Twitter βρήκαν πιο ενδιαφέροντα."
  )
)
