output$case_evolution_greece_text <- renderText(
  paste(
    em("Δείτε την εξέλιξη των κρουσμάτων COVID-19 στην Ελλάδα."),
    br(),br(),
    "Το γράφημα δείχνει την εξέλιξη των ενεργών κρουσμάτων, των επιβεβαιωμένων
   	κρουσμάτων, των αναρρώσεων και των ασθενών που βρίσκονται σε Μονάδες
    Εντατικής Θεραπείας (ΜΕΘ).",
    br(),br(),
    "Μπορείτε να εμφανίσετε ή να κρύψετε μεταβλητές κάνοντας κλικ στα
    αντίστοιχα ονόματα στη λεζάντα. Με διπλό κλικ μπορείτε να απομονώσετε μία
    μεταβλητή.",
    br(),br(),
    "Δοκιμάστε να κάνετε διπλό κλικ στη γραμμή ΜΕΘ της λεζάντας.",
    br(),br(),
    "Μπορείτε επίσης να επιλέξετε να σχεδιαστεί ο άξονας Υ χρησιμοποιώντας
    λογαριθμική κλίμακα.",
    br(),br(),
    em("Σημείωση: Οι αναρρώσεις ενημερώνονται μόνο περιοδικά, όχι σε
       ημερήσια βάση.")
  )
)

output$cases_per_day_greece_text <- renderText(
  paste(
    em("Δείτε τα νέα επιβεβαιωμένα κρούσματα και θανάτους σε ημερήσια βάση."),
    br(),br(),
    "Το γράφημα αναπαριστά τον αριθμό των νέων επιβεβαιωμένων κρουσμάτων και
    των νέων θανάτων ανά ημέρα.",
    br(),br(),
    "Μπορείτε να εμφανίσετε ή να κρύψετε μεταβλητές κάνοντας κλικ στα
    αντίστοιχα ονόματα στη λεζάντα. Με διπλό κλικ μπορείτε να απομονώσετε μία
    μεταβλητή."
  )
)

output$tests_greece_text <- renderText(
  paste(
    em("Δείτε τον αριθμό των ελέγχων δειγμάτων που έχουν πραγματοποιηθεί."),
    br(),br(),
    "Το γράφημα δείχνει τον αριθμό των εργαστηριακών ελέγχων δειγμάτων COVID-19
    που πραγματοποιούνται καθημερινά στην Ελλάδα, όπως επίσης και το αθροιστικό
    (συνολικό) αριθμό τους. Ο αριθμός των νέων ελέγχων εμφανίζεται στον αριστερό
    άξονα Υ, ενώ ο αριθμός των συνολικών ελέγχων δειγμάτων εμφανίζεται στον
    δεξί άξονα Υ.",
    br(),br(),
    "Μπορείτε να εμφανίσετε ή να κρύψετε μεταβλητές κάνοντας κλικ στα
    αντίστοιχα ονόματα στη λεζάντα. Με διπλό κλικ μπορείτε να απομονώσετε μία
    μεταβλητή.",
    br(),br(),
    "Μπορείτε επίσης να επιλέξετε να σχεδιαστεί ο δεξιός άξονας Υ (συνολικοί
    έλεγχοι) χρησιμοποιώντας λογαριθμική κλίμακα"
  )
)

output$gender_greece_text <- renderText(
  paste(
    em("Observe the gender distribution of patients."),
    br(),br(),
    "This plot shows gender ratio of the patients reported in Greece."
  )
)

output$age_greece_text <- renderText(
  paste(
    em("Explore the age distribution of patients"),
    br(),br(),
    "With this plot you can view the age distribution of confirmed cases,
    patients that are in critical condition and deaths due to COVID-19.",
    br(),br(),
    "You may select which variable you would like to use and whether to view
    absolute numbers or percentages."
  )
)

output$timeslider_greece_note <- renderText(
  paste(
    em(paste("ΣΗΜΕΙΩΣΗ: Ανά περιοχή ιστορικά δεδομένα είναι διαθέσιμα μόνο από",
      format(min(data_greece_region_timeline$date), format="%d/%m/%Y"),
      "και μόνο για επιβεβαιωμένα κρούσματα.")
    )
  )
)
