output$measures_text <- renderText(
  paste(
    em("Δείτε το χρονικό της λήψης και απελευθέρωσης περιοριστικών μέτρων στην Ελλάδα."),
    br(),br(),
    "Στο γράφημα εμφανίζονται για πέντε διαφορετικές κατηγορίες (Διεθνείς
    μετακινήσεις, Εκπαιδευτικά ιδρύματα, Θρησκευτικές εκδηλώσεις, Μετακινήσεις
    και συναθροίσεις, Χώροι εργασίας), τα μέτρα που έχει λάβει η Ελληνική
    κυβέρνηση. Τα μέτρα κάθε κατηγορίας ομαδοποιούνται οριζόντια. Σε περίπτωση
    που υπάρχουν πολλαπλά μέτρα μία ημέρα, αυτά τοποθετούνται κάθετα μέσα στην
    κατηγορία.",
    br(),br(),
    "Με πορτοκαλί χρώμα σηματοδοτείται η λήψη μέτρων, ενώ με πράσινο η
    απελευθέρωσή τους. Αφήνοντας το ποντίκι σας πάνω από ένα σημείο, εμφανίζεται
    μια αναλυτική περιγραφή του μέτρου."
  )
)

output$oxford_indices_text <- renderText(
  paste(
    em("Παρακολουθήστε τη μεταβολή δεικτών για τα κυβερνητικά μέτρα."),
    br(),br(),
    tags$a(href = "https://www.bsg.ox.ac.uk/research/research-projects/coronavirus-government-response-tracker", "Το πανεπιστήμιο της Οξφόρδης"),
    "συλλέγει καθημερινά πληροφορίες σχετικά με τη αντίδραση των κυβερνήσεων σε
    κάθε χώρα για την αντιμετώπιση του κορωνοϊού. Σε μια προσπάθεια
    ποσοτικοποίησης των μέτρων που λαμβάνονται, υπολογίζονται τέσσερις δείκτες
    κυβερνητικής αντίδρασης:",
    tags$ul(
      tags$li(tags$b("Δείκτης αυστηρότητας (Stringency Index):"),
              "μετρά την αυστηρότητα μέτρων σε σχέση με πολιτικές όπως η
              απαγόρευση  κυκλοφορίας, οι οποίες περιορίζουν τη συμπεριφορά
              των πολιτών."),
      tags$li(tags$b("Δείκτης κυβερνητικής αντίδρασης (Government Response Index):"),
              "ένας συνολικός δείκτης για τα αντανακλαστικά της κυβέρνησης.
              Καταγράφει τη συνολική αυστηρότητα των μέτρων που έχει θέσει η
              κυβέρνηση."),
      tags$li(tags$b("Δείκτης οικονομικής υποστήριξης (Economic Support Index):"),
              "καταγράφει την εφαρμογή μέτρων υποστήρικης, όπως η ενίσχυση
              εισοδημάτων και η απαλλαγή/διευκόλυνση στην αποπληρωμή χρεών."),
      tags$li(tags$b("Δείκτης περιορισμού και υγείας (Containment and Health Index):"),
              "συνδυάζει πληροφορίες σχετικά με μέτρα όπως ο περιορισμός
              κυκλοφορίας και κλεισίματα καταστημάτων και δομών, μαζί με
              μέτρα που αφορούν στις πολιτικές δειγματοληψίας και ανίχνευσης
              επαφών, βραχυπρόθεσμων επενδύσεων στην υγεία, καθώς και επενδύσεων
              σε εμβόλια"),
    ),
    "Οι δείκτες λαμβάνουν τιμές μεταξύ του 0 και του 100. Πριν τη λήψη
    οποιουδήποτε μέτρου είχαν όλοι μηδενική τιμή, ενώ υψηλότερες τιμές
    σηματοδοτούν αυστηρότερα μέτρα. Για περισσότερες πληροφορίες σχετικά με τον
    υπολογισμό των παραπάνω δεικτών, μπορείτε να επισκευθείτε την ιστοσελίδα",
    tags$a(href = "https://github.com/OxCGRT/covid-policy-tracker/blob/master/documentation/index_methodology.md",
           "της μεθοδολογίας"),
    "του Πανεπιστημίου της Οξφόρδης.",
    br(),br(),
    "Με κόκκινο χρώμα σηματοδοτείται η λήψη μέτρων, ενώ με πράσινο η
    απελευθέρωσή τους. Αφήνοντας το ποντίκι σας πάνω από ένα σημείο, εμφανίζεται
    μια αναλυτική περιγραφή του μέτρου."
  )
)
