output$measures_text <- renderText(
  paste(
    em("Δείτε το χρονικό της λήψης και απελευθέρωσης περιοριστικών μέτρων στην Ελλάδα."),
    br(),br(),
    "Στο γράφημα εμφανίζονται για πέντε διαφορετικές κατηγορίες (Διεθνείς
    μετακινήσεις, Εκπαιδευτικά ιδρύματα, Θρησκευτικές εκδηλώσεις, Μετακινήσεις
    και συναθροίσεις, Χώροι εργασίας), τα μέτρα που έχει λάβει η Ελληνική
    κυβέρνηση. Τα μέτρα κάθε κατηγορίας ομαδοποιούνται οριζόντια. Σε περίπτωση
    που υπάρχουν πολλαπλά μέτρα μία ημέρα, αυτά τοποθετούνται κάθετα μέσα στην
    κατηγορία.",
    br(),br(),
    "Με κόκκινο χρώμα σηματοδοτείται η λήψη μέτρων, ενώ με πράσινο η
    απελευθέρωσή τους. Αφήνοντας το ποντίκι σας πάνω από ένα σημείο, εμφανίζεται
    μια αναλυτική περιγραφή του μέτρου."
  )
)